Revit 2024 API
FillPattern Constructor
 Creates a fill pattern with FillPatternHostOrientation::FPORIENTATION_TO_VIEW and FillPatternTarget::FPTARGET_NONE.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public FillPattern()
Visual Basic
Public Sub New
Visual C++
public:
FillPattern()
See Also
FillPattern Class
FillPattern Overload
Autodesk.Revit.DB Namespace